In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1, 2, 3, 4], index=["a", "b", "c", "d"])
s2 = pd.Series([10, 20, 30, 40], index=["e", "f", "g", "h"])

In [3]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s2

e    10
f    20
g    30
h    40
dtype: int64

In [5]:
s1 + s2

a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
f   NaN
g   NaN
h   NaN
dtype: float64

In [6]:
df1 = pd.DataFrame({"a": [1, 2, 3], "b": [4, 5, 6], "c": [7, 8, 9]},
                  index=["row1", "row2", "row3"])
df2 = pd.DataFrame({"a": [10, 20, 30], "b": [40, 50, 60], "c": [70, 80, 90]},
                  index=["row4", "row3", "row2"])

In [7]:
df1

      a  b  c
row1  1  4  7
row2  2  5  8
row3  3  6  9

In [8]:
df2

       a   b   c
row4  10  40  70
row3  20  50  80
row2  30  60  90

In [10]:
df1 + df2

         a     b     c
row1   NaN   NaN   NaN
row2  32.0  65.0  98.0
row3  23.0  56.0  89.0
row4   NaN   NaN   NaN

In [12]:
df2.loc[["row1", "row2"]]

         a     b     c
row1   NaN   NaN   NaN
row2  30.0  60.0  90.0

In [13]:
df2.diff()

         a     b     c
row4   NaN   NaN   NaN
row3  10.0  10.0  10.0
row2  10.0  10.0  10.0

In [14]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [15]:
pd.concat([a, b], axis=0, join="inner")

    B
0   4
1   5
2   6
3   7
0  44
1   5
2   6
3  77

In [16]:
ridership_df = pd.DataFrame(
    data=[[   0,    0,    2,    5,    0],
          [1478, 3877, 3674, 2328, 2539],
          [1613, 4088, 3991, 6461, 2691],
          [1560, 3392, 3826, 4787, 2613],
          [1608, 4802, 3932, 4477, 2705],
          [1576, 3933, 3909, 4979, 2685],
          [  95,  229,  255,  496,  201],
          [   2,    0,    1,   27,    0],
          [1438, 3785, 3589, 4174, 2215],
          [1342, 4043, 4009, 4665, 3033]],
    index=['05-01-11', '05-02-11', '05-03-11', '05-04-11', '05-05-11',
           '05-06-11', '05-07-11', '05-08-11', '05-09-11', '05-10-11'],
    columns=['R003', 'R004', 'R005', 'R006', 'R007']
)
ridership_df

          R003  R004  R005  R006  R007
05-01-11     0     0     2     5     0
05-02-11  1478  3877  3674  2328  2539
05-03-11  1613  4088  3991  6461  2691
05-04-11  1560  3392  3826  4787  2613
05-05-11  1608  4802  3932  4477  2705
05-06-11  1576  3933  3909  4979  2685
05-07-11    95   229   255   496   201
05-08-11     2     0     1    27     0
05-09-11  1438  3785  3589  4174  2215
05-10-11  1342  4043  4009  4665  3033

In [18]:
ridership_df[["R003", "R004"]].diff()

            R003    R004
05-01-11     NaN     NaN
05-02-11  1478.0  3877.0
05-03-11   135.0   211.0
05-04-11   -53.0  -696.0
05-05-11    48.0  1410.0
05-06-11   -32.0  -869.0
05-07-11 -1481.0 -3704.0
05-08-11   -93.0  -229.0
05-09-11  1436.0  3785.0
05-10-11   -96.0   258.0

In [20]:
pd.concat([a, b], axis=1, join="inner")

   A  B   C   B  D   E
0  0  4   8  44  0   8
1  1  5   9   5  1   9
2  2  6  10   6  2  10
3  3  7  11  77  3  11

In [21]:
df1 = pd.DataFrame({"a": [1, 2, 3], "b": [4, 5, 6], "c": [7, 8, 9]})
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [24]:
df1.applymap(abs)

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [25]:
df1.values.sum()

45

In [26]:
pd.concat([a, b], axis=1, join="outer")

   A  B   C   B  D   E
0  0  4   8  44  0   8
1  1  5   9   5  1   9
2  2  6  10   6  2  10
3  3  7  11  77  3  11

In [29]:
df1.std()

a    1.0
b    1.0
c    1.0
dtype: float64

In [30]:
s1 = pd.Series([1, 2, 3, 4], index=["a", "b", "c", "d"])
s2 = pd.Series([10, 20, 30, 40], index=["c", "d", "e", "f"])

In [31]:
s1 + s2

a     NaN
b     NaN
c    13.0
d    24.0
e     NaN
f     NaN
dtype: float64

In [33]:
df1.mean(axis=1)

0    4.0
1    5.0
2    6.0
dtype: float64

In [34]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({
    "A": [10, 20, 30, 40],
    2: [50, 60, 70, 80],
    3: [90, 100, 110, 120],
    "D": [130, 140, 150, 160]
})

In [35]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({0: [10, 20, 30, 40]})

In [36]:
df + s

    0   1   2   3
0  11 NaN NaN NaN
1  21 NaN NaN NaN
2  31 NaN NaN NaN
3  41 NaN NaN NaN

In [38]:
import numpy as np
df = pd.DataFrame({"A": [1, 2, np.nan],
                   "B": [5, np.nan, np.nan],
                   "C": [1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [40]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [41]:
df = pd.DataFrame({
    'a': [4, 5, 3, 1, 2],
    'b': [20, 10, 40, 50, 30],
    'c': [25, 20, 5, 15, 10]
})

In [42]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [43]:
a.merge(b, on="B", how="right")

     A   B     C  D   E
0  1.0   5   9.0  1   9
1  2.0   6  10.0  2  10
2  NaN  44   NaN  0   8
3  NaN  77   NaN  3  11

In [46]:
df.mean(axis=1)

0    16.333333
1    11.666667
2    16.000000
3    22.000000
4    14.000000
dtype: float64

In [47]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({
    "A": [10, 20, 30, 40],
    2: [50, 60, 70, 80],
    3: [90, 100, 110, 120],
    "D": [130, 140, 150, 160]
})

df + s

//anaconda/lib/python3.6/site-packages/pandas/indexes/base.py:2683: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

    A     2      3   D   0   1
0 NaN  53.0   94.0 NaN NaN NaN
1 NaN  63.0  104.0 NaN NaN NaN
2 NaN  73.0  114.0 NaN NaN NaN
3 NaN  83.0  124.0 NaN NaN NaN

In [48]:
df = pd.DataFrame({"A": [1, 2, np.nan],
                   "B": [5, np.nan, np.nan],
                   "C": [1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [53]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [54]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [55]:
a.merge(b, on="B", how="outer")

     A   B     C    D     E
0  0.0   4   8.0  NaN   NaN
1  1.0   5   9.0  1.0   9.0
2  2.0   6  10.0  2.0  10.0
3  3.0   7  11.0  NaN   NaN
4  NaN  44   NaN  0.0   8.0
5  NaN  77   NaN  3.0  11.0

In [56]:
a = np.array([[1, 55, 44], [99, 0, 2], [2, 11, 10]])
df = pd.DataFrame(data=a, index=["x", "y", "z"], columns=["A", "B", "C"])
df

    A   B   C
x   1  55  44
y  99   0   2
z   2  11  10

In [58]:
df.sort_values(by="A", axis=0)

    A   B   C
x   1  55  44
z   2  11  10
y  99   0   2

In [59]:
s = pd.Series([1, 2, 3])
df = pd.DataFrame({
    0: [10, 20, 30, 40],
    1: [50, 60, 70, 80],
    2: [90, 100, 110, 120],
    3: [130, 140, 150, 160]
})

In [60]:
df

    0   1    2    3
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [61]:
s

0    1
1    2
2    3
dtype: int64

In [62]:
df + s

      0     1      2   3
0  11.0  52.0   93.0 NaN
1  21.0  62.0  103.0 NaN
2  31.0  72.0  113.0 NaN
3  41.0  82.0  123.0 NaN

In [63]:
df = pd.DataFrame({
    'a': [4, 5, 3, 1, 2],
    'b': [20, 10, 40, 50, 30],
    'c': [25, 20, 5, 15, 10]
})
df

   a   b   c
0  4  20  25
1  5  10  20
2  3  40   5
3  1  50  15
4  2  30  10

In [64]:
df.apply(max)

a     5
b    50
c    25
dtype: int64

In [66]:
df.describe()

              a          b          c
count  5.000000   5.000000   5.000000
mean   3.000000  30.000000  15.000000
std    1.581139  15.811388   7.905694
min    1.000000  10.000000   5.000000
25%    2.000000  20.000000  10.000000
50%    3.000000  30.000000  15.000000
75%    4.000000  40.000000  20.000000
max    5.000000  50.000000  25.000000

In [67]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [68]:
pd.concat([a, b], axis=1, join="outer")

   A  B   C   B  D   E
0  0  4   8  44  0   8
1  1  5   9   5  1   9
2  2  6  10   6  2  10
3  3  7  11  77  3  11

In [69]:
df = pd.DataFrame({"A": [1, 2, np.nan],
                   "B": [5, np.nan, np.nan],
                   "C": [1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [70]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [72]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [74]:
a.merge(b, on="B", how="left")

   A  B   C    D     E
0  0  4   8  NaN   NaN
1  1  5   9  1.0   9.0
2  2  6  10  2.0  10.0
3  3  7  11  NaN   NaN

In [75]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.drop("A", axis=1)

     B  C
0  5.0  1
1  NaN  2
2  NaN  3

In [77]:
a = np.array([[1, 55, 44], [99, 0, 2], [2, 11, 10]])
df = pd.DataFrame(data=a, index=["x", "y", "z"], columns=["A", "B", "C"])
df

    A   B   C
x   1  55  44
y  99   0   2
z   2  11  10

In [78]:
df.sort_values(by="x", axis=1)

    A   C   B
x   1  44  55
y  99   2   0
z   2  10  11

In [79]:
df1 = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df2 = pd.DataFrame({"a": [10, 20, 30], "b": [40, 50, 60], 'c': [70, 80, 90]})

In [80]:
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [81]:
df2

    a   b   c
0  10  40  70
1  20  50  80
2  30  60  90

In [82]:
df1 + df2

    a   b   c
0  11  44  77
1  22  55  88
2  33  66  99

In [83]:
df.mean(axis=0)

A    34.000000
B    22.000000
C    18.666667
dtype: float64

In [84]:
df.std(axis=0)

A    56.293872
B    29.103264
C    22.300972
dtype: float64

In [86]:
df.sort_values(by="A", axis=0)

    A   B   C
x   1  55  44
z   2  11  10
y  99   0   2

In [87]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [88]:
a.merge(b, on="B", how="inner")

   A  B   C  D   E
0  1  5   9  1   9
1  2  6  10  2  10

In [90]:
grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)
grades_df

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [91]:
grades_df.apply(lambda x: x.sub(x.mean(axis=0)).div(x.std(axis=0)))

            exam1     exam2
Andre   -2.196525 -2.186335
Barry    0.208891  0.366571
Chris    0.018990 -0.091643
Dan     -0.170911 -0.091643
Emilio   0.715295  0.628408
Fred    -0.487413 -0.418938
Greta    0.841896  1.413917
Humbert -0.803916 -0.746234
Ivan     1.284999  0.955703
James    0.588694  0.170194

In [97]:
df.loc["x"].arga = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})
max()

'B'

In [98]:
a = pd.DataFrame(data={"A": [0, 1, 2, 3], "B": [4, 5, 6, 7], "C": [8, 9, 10, 11]})

b = pd.DataFrame(data={"B": [44, 5, 6, 77], "D": [0, 1, 2, 3], "E": [8, 9, 10, 11]})

In [100]:
pd.concat([a, b], join="inner", axis=0)

    B
0   4
1   5
2   6
3   7
0  44
1   5
2   6
3  77

In [101]:
s = pd.Series([1, 2, 3, 4])
df = pd.DataFrame({
    "A": [10, 20, 30, 40],
    "B": [50, 60, 70, 80],
    "C": [90, 100, 110, 120],
    "D": [130, 140, 150, 160]
})

In [102]:
df

    A   B    C    D
0  10  50   90  130
1  20  60  100  140
2  30  70  110  150
3  40  80  120  160

In [103]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [104]:
df + s

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN